=========
single-quoted string
=========
test: 'some string'
---
(source_file
  (assignment
    (identifier)
    (string)))


=========
double-quoted string
=========
test: "some string"
---
(source_file
  (assignment
    (identifier)
    (string)))


=========
multiline single-quoted string
=========
test: 'some "blah"
 string'
---
(source_file
  (assignment
    (identifier)
    (string)))



=========
multiline double-quoted string
=========
test: "some 'blah'
 string"
---
(source_file
  (assignment
    (identifier)
    (string)))
